# Gurmukhi to Latin
GURMUKHI_LATIN_ALPHABET = {
    'ੳ': 'A', 'ਅ': 'd', 'ੲ': 'D', 'ਸ': 'm', 'ਹ': 'u',
    'ਕ': 'k', 'ਖ': 'K', 'ਗ': 'i', 'ਘ': 'I', 'ਙ': 'ù',
    'ਚ': 'W', 'ਛ': 'Q', 'ਜ': 'p', 'ਝ': 'P', 'ਞ': 'ø',
    'ਟ': 'R', 'ਠ': 'T', 'ਡ': 'G', 'ਢ': 'F', 'ਣ': 'C',
    'ਤ': 'l', 'ਥ': 'L', 'ਦ': 'o', 'ਧ': 'O', 'ਨ': 'v',
    'ਪ': 'h', 'ਫ': 'H', 'ਬ': 'y', 'ਭ': 'Y', 'ਮ': 'c',
    'ਯ': 'U', 'ਰ': 'j', 'ਲ': 'n', 'ਵ': 'b', 'ੜ': 'V'
}

# Latin to Gurmukhi
LATIN_GURMUKHI_ALPHABET = {
    'A': 'ੳ', 'd': 'ਅ', 'D': 'ੲ', 'm': 'ਸ', 'u': 'ਹ',
    'k': 'ਕ', 'K': 'ਖ', 'i': 'ਗ', 'I': 'ਘ', 'ù': 'ਙ',
    'W': 'ਚ', 'Q': 'ਛ', 'p': 'ਜ', 'P': 'ਝ', 'ø': 'ਞ',
    'R': 'ਟ', 'T': 'ਠ', 'G': 'ਡ', 'F': 'ਢ', 'C': 'ਣ',
    'l': 'ਤ', 'L': 'ਥ', 'o': 'ਦ', 'O': 'ਧ', 'v': 'ਨ',
    'h': 'ਪ', 'H': 'ਫ', 'y': 'ਬ', 'Y': 'ਭ', 'c': 'ਮ',
    'U': 'ਯ', 'j': 'ਰ', 'n': 'ਲ', 'b': 'ਵ', 'V': 'ੜ',
}

LATIN_GURMUKHI_DIACRITICS = {
    'e': 'ਾ',  # '0x0A3E'
    'f': 'ਿ', 'r': 'ੀ',  # '0x0A3F', '0x0A40'
    'g': 'ੁ', 't': 'ੂ',  # '0x0A41', '0x042'
    's': 'ੇ', 'w': 'ੈ',  # '0x0A47', '0x0A48'
    'a': 'ੋ', 'q': 'ੌ',  # '0x0A4B', '0x0A4C'
    'N': 'ਂ', 'x': 'ੰ', 'z': 'ੱ',  # '0x0A02', '0x0A70', '0x0A71'
}

LATIN_GURMUKHI_SUBSCRIPTS = {
    'J': '੍ਰ',
    'Í': '੍ਵ',
    'B': '੍ਹ',
}

LATIN_GURMUKHI_NUMERALS = {
    "0": "੦",
    "1": "੧",
    "2": "੨",
    "3": "੩",
    "4": "੪",
    "5": "੫",
    "6": "੬",
    "7": "੭",
    "8": "੮",
    "9": "੯",
}

LATIN_GURMUKHI_BINDI = {
    "M": "ਸ਼",
    "Å": "ਖ਼",
    "Æ": "ਗ਼",
    "Z": "ਜ਼",
    "Ä": "ਫ਼",
}

SPECIAL_CHARS = {
    'X': 'ਾਂ',
    'Ã': '੍ਯ',
    '>': '।',
    'E': 'ਨੂੰ',
    'œ': '੍ਤ',
    'Ñ': '੍ਠ',
    'ç': '੍ਚ',
    'Â': '੍ਨ',
    '†': '੍ਟ',
    'µ': 'ਓ',
    'ú': 'ਕ੍ਰ',
    'ì': '੍ਮ',
    '@': 'ੴ',
    'ó': '।',
    '/': '॥',
    '§': ':-',
    'Ú': ':'
}

DIACRITICS_DUPE = {
    'Ô': 'ੱ',
    'Ç': '੍',
    'S': 'ੱ',
    'û': 'ੰ',
}

WHITE_SPACE = [' ', '\t', '\n']
LATIN_PUNCTUATION_MARKS = ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', ':', ';', '=', '?', '[', '^', '_', '`', '{', '|', '}', '~', '¡', '¥', '©', '®', '°', '·', '¿', '÷', '–', '—', '“', '”', '…', '‰', '™']

MISSING_CHARS = ['å', 'é', 'È', 'Ê', 'Ì', 'í',]
MISSING_DIACRITICS = ['ë', 'ö', 'ê', '´', 'ˆ', 'æ', 'Á', 'ü',]

LATIN_GURMUKHI = {}
LATIN_GURMUKHI.update(LATIN_GURMUKHI_ALPHABET)
LATIN_GURMUKHI.update(LATIN_GURMUKHI_DIACRITICS)
LATIN_GURMUKHI.update(LATIN_GURMUKHI_SUBSCRIPTS)
LATIN_GURMUKHI.update(LATIN_GURMUKHI_NUMERALS)
LATIN_GURMUKHI.update(LATIN_GURMUKHI_BINDI)
LATIN_GURMUKHI.update(SPECIAL_CHARS)
LATIN_GURMUKHI.update(DIACRITICS_DUPE)
LATIN_GURMUKHI.update(dict.fromkeys(WHITE_SPACE, None))
LATIN_GURMUKHI.update(dict.fromkeys(LATIN_PUNCTUATION_MARKS, None))
LATIN_GURMUKHI.update(dict.fromkeys(MISSING_CHARS, None))
LATIN_GURMUKHI.update(dict.fromkeys(MISSING_DIACRITICS, None))

# ABBREVIATIONS
PART_OF_SPEECH = [
    'ਉਪ',
    'ਸਰਵ',
    'ਸੰਗ੍ਯਾ-',
    'ਕ੍ਰਿ',
    'ਕ੍ਰਿ ਵਿ',
    'ਧਾ',
    'ਪ੍ਰਤ੍ਯ',
    'ਵਿ',
]
STANZAS = [
    'ਅ:',
    'ਸ',
    'ਸਹਸ',
    'ਸਾਰ',
]
RAAGS = [
    'ਆਸਾ',
    'ਸੂਹੀ',
    'ਸੋਰ',
    'ਸ੍ਰੀ',
    'ਕਲਿ',
    'ਗਉ',
    'ਚਉ',
    'ਗੂਜ',
    'ਗੌਂਡ',
    'ਜੈਜਾ',
    'ਜੈਤ',
    'ਟੋਡੀ',
    'ਤਿਲੰ',
    'ਤੁਖਾ',
    'ਦੇਵ',
    'ਧਨਾ',
    'ਨਟ',
    'ਪ੍ਰਭਾ',
    'ਬੰਸ',
    'ਬਿਹਾ',
    'ਬਿਲਾ',
    'ਬੈਰਾ',
    'ਭੈਰ',
    'ਮਲਾ',
    'ਮਾਝ',
    'ਮਾਰੂ',
    'ਮਾਲੀ',
    'ਰਾਮ',
    'ਵਡ',
]    
LANGUAGES = [
    'ਅੰ',
    'ਸਿੰਧੀ',
    'ਸੰ',
    'ਹਿੰ',
    'ਹੀ',
    'ਕਾਸ਼',
    'ਕਾਨ',
    'ਕੇਦਾ',
    'ਗੁਜ',
    'ਚੰਬਾ',
    'ਡਿੰਗ',
    'ਤੁ',
    'ਥਲੀ',
    'ਦਖ',
    'ਪਹਾ',
    'ਪਾ',
    'ਪੁਰਤ',
    'ਪੂਰ',
    'ਪ੍ਰਾ',
    'ਫ਼ਾ',
    'ਫ੍ਰ',
    'ਬਾਂਗਰ',
    'ਮਰਾ',
    'ਮਾਗਧੀ',
    'ਮਾਰ',
    'ਮੁਲ',
    'ਯੂ',
    'Latin',
    'ਵ੍ਰਜ',
]
PRAYERS = [
    'ਅਸਫੋ',
    'ਅਕਾਲ',
    'ਅਜਰਾਜ',
    'ਅਜੈ ਸਿੰਘ',
    'ਅਰਹੰਤਾਵ',
    'ਸਨਾਮਾ',
    'ਸਮੁਦ੍ਰਮਥਨ',
    'ਸਲੋਹ',
    'ਸਵਾ',
    'ਸਵੈਯੇ ੩੩',
    'ਸੂਰਜਾਵ',
    'ਕੱਸਪਾਵ',
    'ਕੱਛਾਵ',
    'ਕ੍ਰਿਸਨਾਵ',
    'ਚੌਬੀਸਾਵ',
    'ਚੰਦ੍ਰਾਵ',
    'ਜਲੰਧਰਾਵ',
    'ਦੱਤਾਵ',
    'ਧਨੰਤਰਾਵ',
    'ਨਰਸਿੰਘਾਵ',
    'ਨਰਾਵ',
    'ਪਰਸਰਾਮਾਵ',
    'ਪਾਰਸਾਵ',
    'ਬ੍ਰਮਹਾਵ',
    'ਮੱਛਾਵ',
    'ਰਾਮਾਵ',
    'ਰੁਦ੍ਰਾਵ',
    'ਵਾਮਨਾਵ',
    'ਵਿਸਨਾਵ',
    'ਹਕਾਯਤ',
    'ਹਜ਼ਾਰੇ ੧੦',
    'ਹਨੂ',
    'ਕਲਕੀ',
    'ਖ਼ਾਮ',
    'ਗ੍ਯਾਨ',
    'ਚਰਿਤ੍ਰ',
    'ਚੌਪਈ',
    'ਚੰਡੀ ੧',
    'ਚੰਡੀ ੨',
    'ਚੰਡੀ ੩',
    'ਜਗਰਾਜ',
    'ਜਜਾਤਿ',
    'ਜਨਮੇਜਯ',
    'ਜਫਰ',
    'ਤਨਾਮਾ',
    'ਦਲੀਪ',
    'ਨਸਿਹਤ',
    'ਨਰਨਾਰਾਯਣ',
    'ਪ੍ਰੀਛਤਰਾਜ',
    'ਪ੍ਰਿਥੁਰਾਜ',
    'ਬਾਵਨ',
    'ਬੇਨਰਾਜ',
    'ਮਨੁਰਾਜ',
    'ਮਾਂਦਾਤਾ',
    'ਮੋਹਨੀ',
    'ਯੁਧਿਸ਼ਟ੍ਰਰਾਜ',
    'ਰਘੁਰਾਜ',
    'ਵਰਾਹ',
    'ਵਿਚਿਤ੍ਰ',
]
FIGURE_OF_SPEECH = [
    'ਅਨੁ',
    'ਵਾ',
]
DATES = [
    'ਏ. ਡੀ.',
    'ਸਨ',
    'ਸੰਮਤ',
    'ਬੀ. ਸੀ.', #
]
AUTHORS = [
    'ਕਵਿ ੫੨',
    'ਖ਼ਾ',
    'ਮ',
    'ਵ੍ਰਿੰਦ',
]
SOURCES = [
    'ਗੁਪ੍ਰਸੂ',
    'ਗੁਰੁਪਦ',
    'ਗੁਵਿ ੬',
    'ਗੁਵਿ ੧੦',
    'ਜਸਭਾਮ',
    'ਜਸਾ',
    'ਜ਼ਿੰਦਗੀ',
    'ਜੰਗਨਾਮਾ',
    'ਦੀਗੋ',
    'ਨਾਪ੍ਰ',
    'ਪੰਪ੍ਰ',
    'ਪ੍ਰਾਪੰਪ੍ਰ',
    'ਬੰਨੋ',
    'ਭਗਤਾਵਲੀ',
    'ਭਾਗੁ',
    'ਭਾਗੁਕ',
    'ਮਗੋ',
    'ਮਨੁ',
    'ਰਹਿਤ',
]
ABBR = [
    'ਜ',
    'ਦੇ',
    'ਪੋਠੋ',
    'ਮਾ ਸੰ',
    'ਯੌ',
    'ਲੋਕੋ',
    'ਵਾਰ ੧',
    'ਵਾਰ ੨',
    'ਵਾਰ ੩',
    'ਵਾਰ ੭',
    'ਵ੍ਯ',
]
